In [1]:
import numpy as np
import pandas as pd

# more about pandas

(mostly optional)

- apply()
- datetime type
- object type
- filtering
- merge()
- fillna()
- interpolate()
- melt()
- aggregation: unique count means size first last 
- count missing values

https://towardsdatascience.com/gaining-a-solid-understanding-of-pandas-series-893fb8f785aa

 - arithmetic operation
 - sorting
 - string operation

## creating a series

In [2]:
s1 = pd.Series([1,3,5,7], index=["a", "b", "c", "d"])
s1

a    1
b    3
c    5
d    7
dtype: int64

In [3]:
s2 = pd.Series(np.array([1,3,5,7]), index=["a", "b", "c", "d"])
s2

a    1
b    3
c    5
d    7
dtype: int64

## indexing a series

In [4]:
n = s1["a"]
print(n)
print(type(n))

1
<class 'numpy.int64'>

In [5]:
n = s1[1]
print(n)
print(type(n))

3
<class 'numpy.int64'>

In [6]:
n = s1.loc["c"] # Utilize actual index
print(n)
print(type(n))

5
<class 'numpy.int64'>

In [7]:
s = s1.loc["b":"d"]
print(s)
print(type(s))

b    3
c    5
d    7
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
s = s1.iloc[1:4] # Utilize absolute position starting from 0
print(s)
print(type(s))

b    3
c    5
d    7
dtype: int64
<class 'pandas.core.series.Series'>

## Operation between 2 series objects with different indices

In [9]:
s1 = pd.Series([1,1,1,1], index=list("abcd"))
s1

a    1
b    1
c    1
d    1
dtype: int64

In [10]:
s2 = pd.Series([2,2,2,2], index=list("cdef"))
s2

c    2
d    2
e    2
f    2
dtype: int64

In [11]:
s1 + s2

a    NaN
b    NaN
c    3.0
d    3.0
e    NaN
f    NaN
dtype: float64

## indexing a data frame

In [12]:
df = pd.DataFrame([[1,2],[3,4],[5,6],[7,8]], columns=["First", "Second"], index=["a", "b", "c", "d"])
df1 = df.iloc[1:4]
df2 = df.loc["b":"d"]

In [13]:
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

   First  Second
b      3       4
c      5       6
d      7       8

In [14]:
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

   First  Second
b      3       4
c      5       6
d      7       8

## Operation between a dataframe and a series

In [15]:
df = pd.DataFrame({"a": [1,1,1,1], "b": [2,2,2,2]})
df

   a  b
0  1  2
1  1  2
2  1  2
3  1  2

In [16]:
s = pd.Series([0, 0], index=list("bc"))
s

b    0
c    0
dtype: int64

In [17]:
df + s

    a    b   c
0 NaN  2.0 NaN
1 NaN  2.0 NaN
2 NaN  2.0 NaN
3 NaN  2.0 NaN

In [18]:
df.add(s)

    a    b   c
0 NaN  2.0 NaN
1 NaN  2.0 NaN
2 NaN  2.0 NaN
3 NaN  2.0 NaN

In [19]:
df.add(s, axis=1)

    a    b   c
0 NaN  2.0 NaN
1 NaN  2.0 NaN
2 NaN  2.0 NaN
3 NaN  2.0 NaN

In [20]:
df.add(s, axis=0)

    a   b
0 NaN NaN
1 NaN NaN
2 NaN NaN
3 NaN NaN
b NaN NaN
c NaN NaN

## apply()

## merge()

## references
- https://towardsdatascience.com/gaining-a-solid-understanding-of-pandas-series-893fb8f785aa